Deliverables/Tex/SRS.tex
% Created 2022-03-03 Thu 18:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{enumitem}
\setlist{leftmargin=0.25in,nosep}
\documentclass[10pt,a4paper,showtrims]{document}
\usepackage[labelfont=bf]{caption}
\hypersetup{colorlinks=true, urlcolor={blue}, linkcolor={blue}}
\usepackage[natbib=true]{biblatex}
\usepackage{tikz}
\usetikzlibrary{shapes.misc,shadows,arrows, automata, shapes.multipart, positioning}
\usepackage[linguistics]{forest}
\usepackage{sectsty}
\usepackage{parskip}
\date{}
\title{}
\hypersetup{
 pdfauthor={Tristan Zippert},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.6)}, 
 pdflang={English}}
\begin{document}

\begin{flushright}
    \rule{16cm}{5pt}\vskip1cm
    \begin{bfseries}
        \Huge{SOFTWARE REQUIREMENTS\\ SPECIFICATION}\\
        \vspace{1.5cm}
        for\\
        \vspace{1.5cm}
        Project\\
        \vspace{1.5cm}
        \LARGE{Version \myversion}\\
        \vspace{1.5cm}
        Prepared by : Tristan Zippert\\
    Donato Apon \\
     David DiFrumolo\\
       Gedeon Rugema\\
    Connor Lariviere\\ 
        \vspace{1.5cm}
        Organization : CityCircuit\\
        \vspace{1.5cm}
        \today\\
    \clearpage
    \end{bfseries}
\end{flushright}
\tableofcontents
\section*{Revision History}
\label{sec:org9b34e07}
\begin{center}
\begin{tabular}{lllr}
Name & Date & Reason for Changes & Version\\
\hline
Tristan, Donato, David, Gedeon, Connor & 2/18/2022 & Added Functional Requirements & 0.01\\
Tristan, Donato, David, Gedeon, Connor & 3/2/2022 &  & 0.02\\
\end{tabular}
\end{center}
\section{Introduction}
\label{sec:orga38c260}
\subsection{Purpose}
\label{sec:orgc2e2695}
The purpose of this document is to outline the requirement specification for the Endless Pinball game and its connected website. The scope of this document is to outline the interactions the user would have with the game, as well as to highlight what needs to be done during the development phase of this project. 
\subsection{Document Conventions}
\label{sec:org9845e43}
\subsection{Intended Audience and Reading Suggestions}
\label{sec:org15def12}
\subsection{Product Scope}
\label{sec:orgd54810b}
\subsection{References}
\label{sec:org9f2808f}
\section{Overall Description}
\label{sec:orgb8d040b}
\subsection{Product Perspective}
\label{sec:org2463a01}
\subsection{Product Functions}
\label{sec:orgdeaf73e}
\subsection{User Classes and Characteristics}
\label{sec:org19c4b78}
\subsection{Operating Environment}
\label{sec:org55f9c03}
\subsection{Design and Implementation Constraints}
\label{sec:orgacff728}
\subsection{User Documentation}
\label{sec:orgc41ebbd}
\subsection{Assumptions and Dependencies}
\label{sec:orgb5bbdbb}
\section{External Interface Requirements}
\label{sec:orgc631535}
\subsection{User Interfaces}
\label{sec:org7904af6}
The software outlined in this document will have two sets of user interfaces, one for the website and one for the Endless Pinball game itself. 
\begin{description}
\item[{Endless Pinball:}] The Endless Pinball game will be designed using the \textbf{MVC} architecture design pattern for its UI as we want the controller to handle any interactable scenarios for the user. The controller would handle the events that the user would use to control the pinball, and to select in the pause menu. The view, in our case, would display data such as the score the user currently has and what power-up they have. The Model part would manage all the incoming data and the View would display it.
\item[{Endless Pinball website:}] Our website would use the Client-Server architecture, as it is intended just to display the high scores from the game. The website would receive POST requests from the game, and would have no controller for user interaction. This will allow the user to visit the site, and the site will update the view and display it to the user when a new high score is received.
\end{description}
\subsection{Hardware Interfaces}
\label{sec:org1316e46}
The game will interact with the phones vibration motors to make the game more interactive, and could also interact with the phones gyro sensor to control the pinball. The game will also interact with the phones internal GPU in order to render the game. 
\subsection{Software Interfaces}
\label{sec:org800a726}
\subsection{Communications Interfaces}
\label{sec:orgddde17a}
The game will use GET requests in the form of JSON to the game application,
and the game application will use POST to post user uploaded pictures and the high score from the user. Communication is done between the website
and the Endless Browser game application, allowing users to upload their high score. 
\section{System Features}
\label{sec:org4af94b1}
<This template illustrates organizing the functional requirements for the product by system
features, the major services provided by the product. You may prefer to organize this section by
use case, mode of operation, user class, object class, functional hierarchy, or combinations of
these, whatever makes the most logical sense for your product.>
\subsection{Pinball Game System Feature}
\label{sec:org98a5326}
\subsubsection{Description and Priority}
\label{sec:orgec63648}
\subsubsection{Stimulus/Response Sequences}
\label{sec:org93b0be6}
\subsubsection{Functional Requirements}
\label{sec:org16aa4b3}
Functional Requirements are as follows for both the Endless Pinball app and the Endless Pinball website. 
\begin{description}
\item[{REQ-1:}] The Endless Pinball system shall display a continuous path for the user until failure
\item[{REQ-2:}] The Endless Pinball system shall save the user’s high score data.
\item[{REQ-3:}] The Endless Pinball system shall register inputs from the user, to manipulate the pinball.
\item[{REQ-4:}] The Endless Pinball system shall select a specific color for their pinball.
\item[{REQ-5:}] The Endless Pinball system shall allow the user to adjust the volume.
\item[{REQ-6:}] The Endless Pinball system shall allow the user to replay the game after failure
\item[{REQ-7:}] The Endless Pinball system shall allow the user to select the music that plays during the game.
\item[{REQ-8:}] The Endless Pinball system shall allow the user to select a theme for their pinball board.
\item[{REQ-9:}] The Endless Pinball system shall play specific sound effects when the pinball collides with objects.
\item[{REQ-10:}] The Endless Pinball system shall simulate realistic physics bounces for the pinball.
\item[{REQ-11:}] The Endless Pinball system shall save the user’s highest score.
\item[{REQ-12:}] The Endless Pinball system shall vibrate the user’s device when the pinball collides into objects.
\item[{REQ-13:}] The Endless Pinball system shall subtract a life point from the user when they fail.
\item[{REQ-14:}] The Endless Pinball system shall subtract from the users high score when a life point is removed from the user
\item[{REQ-15:}] The Endless Pinball system shall reset the round when all of the life points are subtracted from the user.
\end{description}
\subsection{System Feature 2}
\label{sec:org0a77174}
\section{Other Nonfunctional Requirements}
\label{sec:org0fbc4d6}
\begin{description}
\item[{REQ-1:}] The Endless Pinball system shall load the player’s pinball in 3 seconds 95\% of the time.
\item[{REQ-2:}] The Endless Pinball system website shall be able to load within 1 second 98\% of the time.
\item[{REQ-3:}] The Endless Pinball system shall display a replay button in 3 seconds after failure 95\% of the time
\item[{REQ-4:}] The Endless Pinball system shall indicate a life point loss within 1 second 95\% of the time
\item[{REQ-5:}] The Endless Pinball system shall provide feedback within one second of the user’s request 99\% of the time
\item[{REQ-6:}] The Endless Pinball system website shall be able to receive web requests from the endless Pinball system within 1 second of data being sent 98\% of the time.
\item[{REQ-7:}] The Endless Pinball system shall be able to send data successfully to the website 96\% percent of the time.
\item[{REQ-8:}] The Endless Pinball game system shall be available to the users 99\%z of the time.
\item[{REQ-9:}] The website system shall be able to log data without error to the database 95\% of the time.
\item[{REQ-10:}] The website system shall be available to users twenty-four-seven 90\% of the time.
\end{description}
\subsection{Performance Requirements}
\label{sec:orgcccfe9b}
\subsection{Safety Requirements}
\label{sec:org4a498e1}
\subsection{Security Requirements}
\label{sec:org6550ef9}
\subsection{Software Quality Attributes}
\label{sec:org1f5fe7e}
\subsection{Business Rules}
\label{sec:org53e0420}
\section{Other Requirements}
\label{sec:org104a584}
\subsection*{Appendix A: Glossary}
\label{sec:org0a3bda7}
\begin{description}
\item[{MVC (Model View Controller):}] Model View Controller is a design pattern defining interaction between View, Controllers and Models.
\end{description}
\subsection*{Appendix B: Analysis Models}
\label{sec:orgb83e234}
\end{document}